package main

import (
	"log"

	tgbotapi "github.com/go-telegram-bot-api/telegram-bot-api"
)

func main() {
	bot, err := tgbotapi.NewBotAPI("1300225058:AAFUn2plZtGX6E3McWD7TU_wABE7xH0hLhg")
	if err != nil {
		log.Panic(err)
	}

	bot.Debug = true

	log.Printf("Authorized on account %s", bot.Self.UserName)

	u := tgbotapi.NewUpdate(0)
	u.Timeout = 60

	updates, err := bot.GetUpdatesChan(u)

	for update := range updates {
		if update.Message == nil {
			continue
		}
		msg := tgbotapi.NewMessage(update.Message.Chat.ID, "По ціому питанню я не можу відповісти.")

		switch update.Message.Text {
		case "/start":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Вас приветствует телеграмм бот ОСББ «Вишнева оселя-5»"
		case "Про ОСББ":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Шановні мешканці, підготувала для вас статут мешканця ОСББ “Вишнева оселя-5” для доступності контактів працівників ОСББ, інструкції користування каналізацією, на випадок затоплення, розуміння ваших обов’язків. З того моменту як мешканці будинків с. Крюківщина, вул. Вишнева 23, 25 та 27 прийняли рішення створити Об’єднання співвласників багатоквартирного будинку – це наша з вами спільна відповідальність і власність. Саме ми з вами відповідаємо за чистоту у дворі, під’їздах, на поверхах, примножування зелених насаджень, відсутність слідів взуття на клумбах, викинуте сміття у смітник, а не поряд з ним, наявність ручок на вікнах і т.д. Якщо ви думаєте, що це все залежить тільки від Голови правління, то ви глибоко помиляєтесь."
		//--------------------------------------
		case "Правила":
			msg.ReplyMarkup = RuleKeyboard()
			msg.Text = "Правила ОСББ «Вишнева оселя-5»"
		case "Територія двору":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Правила користування територією двору та місцями загального користування.\n1. На території ОСББ “Вишнева оселя-5” обов’язкове дотримання чистоти. Сміття викидаємо тільки у смітники.\n2. Забороняється палити на сходинкових майданчиках.\n3. Забороняється  викидати будівельне сміття.\n4. Забороняється  викидати недопалки з вікон.\n5. У випадку порушення правил власнику буде виставлено штраф."
		case "Кондиціонери":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Правила встановлення кондиціонерів.\n1. Забудовником передбачено план встановлення кондиціонерів.\n2. ОСББ вимагає дотримання цього плану.\n3. Встановлення кондиціонеру потрібно погодити з Головою правління."
		case "Платіжна дисципліна":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Платіжна дисципліна.\n1. 	ОСББ “Вишнева оселя-5” виставляє квитанції до 10 числа місяця, наступного за звітним.\n2. 	Платежі за утримання будинку здійснюються до 25 числа місяця, наступного за звітним.\n3.	У випадку прострочки (наприклад, за січень) відключення комунікацій відбувається 01 числа (тобто 01 березня)."
		//--------------------------------------
		case "Інструкції":
			msg.ReplyMarkup = InstructionKeyboard()
			msg.Text = "Інструкції ОСББ «Вишнева оселя-5»"
		case "Затоплення":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Інструкція на випадок затоплення.\n1. В коридорі на поверх вище перекрити воду сусідам над вами.\n2. Спробувати вийти на зв’язок з сусідами – постукати в двері, лишити записку, взяти телефон в Голови правління і набрати сусідів.\n3. Якщо ситуація глобальна, самостійно не справляєтесь – повідомити Голову правління про необхідність складення акту затоплення."
		case "Витоку газу":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Інструкція на випадок витоку газу.\n1. Зателефонуйте 104 з мобільного. Виклик безкоштовний.\n2. Напишіть в чат будинку та проінформуйте Голову правління.\n3. Відкрийте вікна у квартирі та під’їзді, відключіть газові прилади у КВАРТИРІ, перекрийте вентель подачі газу на плиту У КВАРТИРУ.\n4. Вийдіть з будинку до приїзду аварійної служби.\n5. Не вмикайте і не вимикайте світло та будь-які електричні прибори. Не паліть, не користуйтесь вогнем і стаціонарним телефоном."
		case "Каналізація":
			msg.ReplyMarkup = MainKeyboard()
			msg.Text = "Інструкція користування каналізацією.\n1. Каналізація не смітник. Слідкуємо за тим, що викидаємо.\n2. Не можна викидати в каналізацію: памперси, засоби особистої гігієни, одяг, будівельні суміші, будівельне сміття, вологі серветки, вушні палички, залишки їжі, ганчірки, використаний наповнювач від котячого туалету, поліетиленові пакети, предмети з пластику, скла, дерева, металу, чайну заварку, жувальні гумки, зубну нитку."
		//--------------------------------------
		case "Зареєструвати запит":
			msg.ReplyMarkup = RequestKeyboard()
			msg.Text = "Виберіть тип запиту"

		//--------------------------------------
		case "/stop":
			msg.ReplyMarkup = tgbotapi.NewRemoveKeyboard(true)
		}

		bot.Send(msg)
	}
}
